app/controllers/api/v1/projects_controller.rb

      def index
        headers['Access-Control-Allow-Origin'] = '*'
        @projects = Project.all
---
SELECT `projects`.* FROM `projects`

      def create
      Project.create(project_params)
---
INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('ss', 'ddd', '2015-08-11 10:22:07', '2015-08-11 10:22:07')