app/controllers/projects_controller.rb

INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Sample', 'Nothing, need to be updated.', '2015-07-20 10:32:48', '2015-07-20 10:32:48')
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE `projects` SET `title` = 'AngularJS - 1', `description` = 'Builtin functions list', `updated_at` = '2015-07-20 12:17:00' WHERE `projects`.`id` = 1
---
  def update
    respond_to do |format|
      if @project.update(project_params)

DELETE FROM `projects` WHERE `projects`.`id` = 3
---
  def destroy
    @project.destroy

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`description`, `commentable_id`, `commentable_type`, `created_at`, `updated_at`) VALUES ('fdf', 1, 'Project', '2015-07-20 13:14:42', '2015-07-20 13:14:42')
---
  def create_project_comment
    @commentable = Project.find(params[:project_id])
    Comment.create(:description => params[:comment_content],:commentable => @commentable)